# Ejercicio Ttitanic

In [5]:
import seaborn as sns
import numpy as np
import pandas as pd

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [7]:
#Analisis en base a categorias(Factor=Analizar algo,convertir de texto a una forma de clasificacion)

In [106]:
titanic["survived"] = pd.Categorical(titanic['survived'])
titanic['pclass'] = pd.Categorical(titanic['pclass'])
titanic['sex'] = pd.Categorical(titanic['sex'])
titanic['deck'] = pd.Categorical(titanic['deck'])

# Tablas de Contingencia de una variable

In [107]:
tab = pd.crosstab(index = titanic['survived'],
                 columns = "Pasajeros")
tab

col_0     Pasajeros
survived
0               549
1               342

In [22]:
type(tab)

pandas.core.frame.DataFrame

In [124]:
#Consultamos las personas que habia en cada clase
clase = pd.crosstab(index = titanic['pclass'],   
                   columns="Pasajeros")
clase

col_0   Pasajeros
pclass
female        314
male          577

In [26]:
#Analisamos la columnadel genero
genero = pd.crosstab(index = titanic['sex'],
                    columns="Pasajeros")
genero

col_0   Pasajeros
sex
female        314
male          577

In [28]:
cubiertas = pd.crosstab(index = titanic["deck"],
                       columns = "count")
cubiertas

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [29]:
titanic.deck

0      NaN
1        C
2      NaN
3        C
4      NaN
5      NaN
6        E
7      NaN
8      NaN
9      NaN
10       G
11       C
12     NaN
13     NaN
14     NaN
15     NaN
16     NaN
17     NaN
18     NaN
19     NaN
20     NaN
21       D
22     NaN
23       A
24     NaN
25     NaN
26     NaN
27       C
28     NaN
29     NaN
      ...
861    NaN
862      D
863    NaN
864    NaN
865    NaN
866    NaN
867      A
868    NaN
869    NaN
870    NaN
871      D
872      B
873    NaN
874    NaN
875    NaN
876    NaN
877    NaN
878    NaN
879      C
880    NaN
881    NaN
882    NaN
883    NaN
884    NaN
885    NaN
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): [A, B, C, D, E, F, G]

In [32]:
cubiertas.shape

(7, 1)

In [34]:
cubiertas.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

##  Tablas de frecuencias relativas

In [37]:
cubiertas/cubiertas.sum()
#Podemos observar cuanta gente se hospeadaba en cada cubierta

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

In [41]:
genero/genero.sum()

col_0   Pasajeros
sex
female   0.352413
male     0.647587

In [42]:
clase/clase.sum()

col_0   Pasajeros
class
First    0.242424
Second   0.206510
Third    0.551066

In [51]:
info = tab/tab.sum()
info

col_0     Pasajeros
survived
0          0.616162
1          0.383838

# Tablas Bidimencionales

In [55]:
supG = pd.crosstab(index = titanic['survived'],
                  columns = titanic['sex'])
#Recomendacion dar nombre significativo
supG.index = ["Muerto","Vivo"]
supG.columns = ["Mujer","Hombre"]
supG

        Mujer  Hombre
Muerto     81     468
Vivo      233     109

In [127]:
supE = pd.crosstab(index = titanic['survived'],
                  columns = titanic['class'],
                  margins = True)
#Damos nombre significativo
supE.index = ["Muerto","Vivo","total_sup"]
supE.columns = ["1raClase","2daClase","3raClase","total_clas"]
supE

           1raClase  2daClase  3raClase  total_clas
Muerto           80        97       372         549
Vivo            136        87       119         342
total_sup       216       184       491         891

# Frecuencias relativas Globales.

In [109]:
supE/supE.loc["total_sup","total_clas"]

           1raClase  2daClase  3raClase  total_clas
Muerto     0.089787  0.108866  0.417508    0.616162
Vivo       0.152637  0.097643  0.133558    0.383838
total_sup  0.242424  0.206510  0.551066    1.000000

# Frecuencia Relativa Marginal

**Tomemos en cuenta que loc nos permite localizar filas no columnas por lo tanto si queremos aplicarlo a la clase no nos dara**

## Formas de hacer la frecuencias relativas marginales.

In [113]:
# 1.
supE/supE.loc["total_sup"]

           1raClase  2daClase  3raClase  total_clas
Muerto      0.37037  0.527174  0.757637    0.616162
Vivo        0.62963  0.472826  0.242363    0.383838
total_sup   1.00000  1.000000  1.000000    1.000000

In [110]:
#1.1
supE.div(supE.loc["total_sup"], axis = 1)

           1raClase  2daClase  3raClase  total_clas
Muerto      0.37037  0.527174  0.757637    0.616162
Vivo        0.62963  0.472826  0.242363    0.383838
total_sup   1.00000  1.000000  1.000000    1.000000

In [96]:
#2.
supE.T/supE["total_clas"]

              Muerto      Vivo  total_sup
1raClase    0.145719  0.397661   0.242424
2daClase    0.176685  0.254386   0.206510
3raClase    0.677596  0.347953   0.551066
total_clas  1.000000  1.000000   1.000000

In [111]:
#2.2
supE.div(supE["total_clas"], axis = 0)

           1raClase  2daClase  3raClase  total_clas
Muerto     0.145719  0.176685  0.677596         1.0
Vivo       0.397661  0.254386  0.347953         1.0
total_sup  0.242424  0.206510  0.551066         1.0

## Espacios de  Dimension - *$n$*.

In [146]:
sup_sex_class = pd.crosstab(index = titanic["survived"],
                           columns = [titanic["sex"],titanic["class"]],
                           margins = True)


sup_sex_class

sex      female               male               All
class     First Second Third First Second Third
survived
0             3      6    72    77     91   300  549
1            91     70    72    45     17    47  342
All          94     76   144   122    108   347  891

In [138]:
sup_sex_class["female"]

class     First  Second  Third
survived
0             3       6     72
1            91      70     72
All          94      76    144

In [141]:
sup_sex_class["male"]

class     First  Second  Third
survived
0            77      91    300
1            45      17     47
All         122     108    347

In [144]:
sup_sex_class["female","First"]

survived
0       3
1      91
All    94
Name: (female, First), dtype: int64

In [148]:
#Marginal
sup_sex_class/sup_sex_class.loc["All"]

sex         female                      male                           All
class        First    Second Third     First    Second     Third
survived
0         0.031915  0.078947   0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053   0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000   1.0  1.000000  1.000000  1.000000  1.000000